[
  {
    "company": "InfoSys · Full-time",
    "position": "Software Development Consultant",
    "time": "Jul 2018 - Present · 4 yrs 3 mos",
    "description": "Home office job, with many travels to some clients office, always trying to give a trustable experience, giving solutions for the companies problems being from software and/or project management. Having the opportunity to know and apply new solutions, make improvements and fix. Using some programming languages like C#, Java, Node, and others in various environments like Windows, Linux and Cloud Platforms on clients such: Apple, Globo, pFizer, Visa, Syngenta, Nutrien, and more."
  },
  {
    "company": "Telefônica Brasil",
    "position": "Senior Analyst",
    "time": "Mar 2016 - Jul 2018 · 2 yrs 5 mos",
    "description": "Development of solutions to manage the infrastructure for the services offered by Telefonica in real-time (TV, Internet and Phone). The software processes alarms generated by all the equipment (SNMP traps), automatically open tickets if one equipment or multiple send a specific alarm or a specific group of alarms, has a logic to auto-close the tickets, remotely access some equipment, send commands and based on the results perform some action. My team was also responsible to create applications to measure and monitor such automation, the number of alarms and making the daily work of the employees easier (communication, people management, goods management, data analytics, etc…)."
  },
  {
    "company": "GVT",
    "position": "Pleno Software Developer",
    "time": "Dec 2014 - Dec 2015 · 1 yr 1 mo",
    "description": "Development (AngularJS, Java EE, GlassFish, Jersey, ...) and planning of new solutions (automation, local systems and web systems) to help internal areas of the company."
  },
  {
    "company": "AMERICA LATINA LOGISTICA",
    "position": "AnalystAnalyst",
    "time": "Jun 2014 - Dec 2014 · 7 mos",
    "description": "Helps on the development (Java, JEE, JSF, OracleDB, ...) and communication with the client in a project that controls the schedule of the train drivers in real-time, the trains can’t be stopped when having someone able to drive, the system covers the whole train fleet, shows the time that each train is expected to arrive at each stop and the employees that are able to work at that location."
  },
  {
    "company": "Web Developer",
    "position": "POW Internet",
    "time": "Sep 2013 - Jun 2014 · 10 mos",
    "description": "Develop and improve sites as well as web applications using PHP and Codeigniter. Work in teams, using SVN as application version control."
  }
]
