[
  {
    "company": "InfoSys · Full-time",
    "position": "Software Development Consultant",
    "time": "Jul 2018 - Present · 4 yrs 3 mos",
    "description": "Worked with high-profile clients including Apple, Globo, Pfizer, Visa, Syngenta, and Nutrien, delivering full-stack development, cloud infrastructure, and mobile solutions. Collaborated closely with client teams to understand business needs and deliver practical, scalable systems."
  },
  {
    "company": "Telefônica Brasil",
    "position": "Senior Analyst",
    "time": "Mar 2016 - Jul 2018 · 2 yrs 5 mos",
    "description": "As a Senior Analyst at Telefônica Brasil, I developed real-time infrastructure management solutions for the company's core services, including TV, Internet, and Phone. My work focused on creating systems that processed equipment-generated alarms (SNMP traps), automated ticket creation and closure, enabled remote equipment access and command execution, and triggered actions based on results. Additionally, my team built applications to monitor automation effectiveness and streamline daily operations for employees."
  },
  {
    "company": "GVT",
    "position": "Pleno Software Developer",
    "time": "Dec 2014 - Dec 2015 · 1 yr 1 mo",
    "description": "Worked across internal platforms and automation systems to improve operational efficiency within multiple departments. Delivered full-stack web and mobile solutions using modern frameworks and introduced key technologies that shaped the team’s long-term development approach."
  },
  {
    "company": "AMERICA LATINA LOGISTICA",
    "position": "AnalystAnalyst",
    "time": "Jun 2014 - Dec 2014 · 7 mos",
    "description": "As an Analyst at América Latina Logística, I played a key role in enhancing and maintaining a critical system responsible for managing driver schedules, shifts, and breaks. My responsibilities included developing new modules and resolving bugs, working closely with Project Owners and clients to gather requirements, provide regular updates, and ensure all delivered solutions precisely met their operational needs."
  },
  {
    "company": "Web Developer",
    "position": "POW Internet",
    "time": "Sep 2013 - Jun 2014 · 10 mos",
    "description": "As a Web Developer at POW Internet, I was responsible for the development and enhancement of a variety of websites and web applications. My role involved utilizing PHP and CodeIgniter within a collaborative team environment, managing application versions with SVN. I focused on delivering visually appealing and functional web solutions that met client specifications."
  }
]
